[
    {
        "text": "The Zionist occupation aircraft are launching violent raids on Haidar Abdel Shafi roundabout, west of Gaza City, now.",
        "cleaned_text": "Zionist occupation aircraft are conducting attacks at Haidar Abdel Shafi roundabout, located west of Gaza City.",
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:03:37+00:00"
    },
    {
        "text": "After their return from the front lines. Al-Qassam fighters confirmed targeting a \"Merkava\" tank tower with a Tandem shell east of Jabalia city in the northern Gaza Strip on 2025721",
        "cleaned_text": "Al-Qassam fighters targeted a Merkava tank tower with a Tandem shell east of Jabalia city in the northern Gaza Strip on 2025, 2021.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T15:54:37+00:00"
    },
    {
        "text": "Al-Qassam Brigades target a Zionist troop carrier with a powerful landmine in the Abasan Al-Kabira area east of Khan Yunis city in the southern Gaza Strip",
        "cleaned_text": "Al-Qassam Brigades targeted a Zionist troop carrier with a landmine in the Abasan Al-Kabira area, east of Khan Yunis city, in the southern Gaza Strip.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T12:56:24+00:00"
    },
    {
        "text": "Al-Qassam fighters, in cooperation with the Al-Quds Brigades fighters, managed to shell an enemy command and control site near the courts complex south of Khan Younis city in the southern Gaza Strip with several mortar shells",
        "cleaned_text": "Al-Qassam fighters and Al-Quds Brigades cooperated to shell an enemy command site near Khan Younis city's courts complex in southern Gaza Strip using multiple mortar shells.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-26T18:53:18+00:00"
    },
    {
        "text": "IDF: A short while ago, a terrorist hurled a brick toward IDF soldiers during an operational activity in Hebron. The soldiers fired toward the terrorist in order to remove the threat. The terrorist was neutralized, and no IDF injuries were reported.",
        "cleaned_text": "A terrorist threw a brick at IDF soldiers during an operational activity in Hebron. Soldiers fired at the terrorist to neutralize the threat. The terrorist was neutralized and no IDF injuries were reported.",
        "channel": "idfofficial",
        "date": "2025-07-28T17:01:48+00:00"
    },
    {
        "text": "IDF: Earlier today Sunday, an officer in the Desert Reconnaissance Battalion 585, and a reservist tracker in the Southern Brigade, Gaza Division, were severely injured during combat in the southern Gaza Strip. The officer and tracker were evacuated to a hospital to receive medical treatment, and their families have been notified.",
        "cleaned_text": "On Sunday, an officer from Desert Reconnaissance Battalion 585 and a reservist tracker from the Southern Brigade, Gaza Division were severely injured during combat in southern Gaza Strip. Both individuals were evacuated to a hospital for treatment, and their families have been notified.",
        "channel": "idfofficial",
        "date": "2025-07-27T12:14:10+00:00"
    },
    {
        "text": "IDF: Troops of the 646th Reservist Brigade Dismantled a Terror Tunnel Route as Well as Hundreds of Terrorist Infrastructure Sites Both Above and Below Ground Troops from the 646th Brigade, under the command of the 99th Division, operated over the past three months in the areas of the Netzarim corridor, Shuja'iyya, Daraj Tuffah, and Beit Hanoun in the Gaza Strip. During the activities, the troops located and dismantled hundreds of terrorist infrastructure sites, including military structures, weapons storage facilities, and enemy firing and observation positions. In addition, approximately 400 terrorists were eliminated, as a result of cooperation between ground troops and the Israeli Air Force. In recent days, troops from the 646th Brigade and Yahalom unit dismantled a Hamas terror tunnel approximately 500 meters long in the Beit Hanoun area. The tunnel was located as part of an ongoing effort to locate and dismantle underground routes used by the Hamas terrorist organization. IDF troops continue to operate against terrorist organizations in the Gaza Strip in order to protect Israeli civilians. Attached are the following: Footage from within the Hamas terror tunnel in the Beit Hanoun area: Footage from the dismantling of the Hamas terror tunnel in the Beit Hanoun area: Photos of the activities of the 646th Brigade in the Gaza Strip:",
        "cleaned_text": "IDF's 646th Reservist Brigade dismantled a terror tunnel route and hundreds of terrorist infrastructure sites above and below ground in Netzarim corridor, Shuja'iyya, Daraj Tuffah, and Beit Hanoun in the Gaza Strip over three months.",
        "channel": "idfofficial",
        "date": "2025-07-27T12:02:52+00:00"
    },
    {
        "text": "IDF troops from the 646th Reservist Brigade dismantled a Hamas tunnel about 500 meters long in Beit Hanoun, as part of a months-long operation.",
        "cleaned_text": "IDF's 646th Reservist Brigade dismantled a 500-meter long Hamas tunnel in Beit Hanoun, during an ongoing operation.",
        "channel": "the_jerusalem_post",
        "date": "2025-07-27T14:25:07+00:00"
    }
]