[
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T19:36:43+00:00",
        "text": "In Gaza. words have run out. There is no description that can capture the scale of famine and genocide. We are dying in silence, and the world watches. Do not forget us."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T17:30:21+00:00",
        "text": "She died of hunger in the Muslim countries, Gaza now"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T14:44:22+00:00",
        "text": "A child has died of starvation in the central Gaza Strip."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T13:56:29+00:00",
        "text": "The oppression in people's eyes and the extent of the disappointment is indescribable"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T09:10:40+00:00",
        "text": "A starving Palestinian family weeps after the head of the family was able to obtain a bag of flour and return to them safely in Gaza."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T07:17:01+00:00",
        "text": "The children of Gaza. half-souls dying slowly, infants writhing with hunger, their thin bodies screaming soundlessly, no milk, no food, no medicine, not even a glimmer of hope, their little hearts dying silently, they have known nothing of life but oppression, and their bodies have turned into skeletons, as if life abandoned them before it even began."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:37:32+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago in several areas in Israel, a missile launched from Yemen was intercepted by the IAF. Sirens were sounded in accordance with protocol."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:33:22+00:00",
        "text": "IDF: Initial report - Sirens sounded in several areas in Israel following a projectile that was launched from Yemen. The details are under review."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:13:39+00:00",
        "text": "IDF: A One-Kilometer-Long Tunnel Containing Hamas Explosive Devices and Weapons Was Located: Footage From the Activity of Golani Brigade Troops in the Gaza Strip Troops from the Golani Brigade, under the command of the 36th Division, are operating in the Khan Yunis area of the Gaza Strip. As part of the activity, troops from the Golani Brigade and the Yahalom Unit located an underground tunnel approximately one kilometer long and 15 meters deep, in which weaponry belonging to the Hamas terrorist organization was hidden, including explosives, AK-47 rifles, and RPG missiles. The tunnel was partially dismantled. In addition, the troops eliminated dozens of terrorists and dismantled numerous terrorist infrastructure sites, including military structures, weapons stockpiles, observation posts, and launch positions aimed at our troops. Troops from the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect the civilians of the State of Israel. Attached are the following: Footage from within an underground tunnel where weapons were located: Footage from the body cameras of the Golani Reconnaissance Battalion in the Gaza Strip: Footage from the dismantling of terror infrastructure sites in the Gaza Strip:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T13:36:06+00:00",
        "text": "IDF: Earlier today Tuesday, IDF troops operating in southern Khan Yunis conducted targeted raids on weapons storage locations. The weapons included cartridges, grenades, munitions, diving equipment and combat uniforms. IDF troops continue to operate in the Khan Yunis area in the southern Gaza Strip, to locate and dismantle terrorist infrastructure of the Hamas terrorist organization. Attached are photos of the weapons that were located:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T12:24:49+00:00",
        "text": "IDF: Today Tuesday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE, Jordan and Egypt, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 52 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T09:05:44+00:00",
        "text": "IDF: Directed by IDF and ISA intelligence, IDF troops continue operations against terrorist organizations in the Gaza Strip In the Khan Yunis area, IDF troops eliminated several terrorists who posed a threat, while the IAF targeted terrorist infrastructure and multiple weapons storage facilities over the past day. In one strike, secondary explosions were identified following the strike on a weapons storage facility, indicating the presence of large quantities of weapons in the structure. Throughout the past day, IDF troops continued operating in the areas in northern Gaza, dismantling launch and fire capabilities and dismantling terrorist infrastructure both above and below ground. Several terrorists were eliminated in ground engagements. Over the past day, the IAF, in cooperation with ground troops, struck dozens of terror targets across the Gaza Strip, including terrorists, military structures, launch posts, weapons storage facilities, tunnels, military posts, and other terrorist infrastructure."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-07-29T22:25:54+00:00",
        "text": "A new investigation published by Arms Embargo Now Campaign AEN reveals Canada has continued supplying weapons to 'israel' during its assault on Gaza, contradicting official claims that such exports had stopped. Newly uncovered shipping records and 'israeli' government data show 47 documented shipments of military components from Canadian manufacturers to 'israeli' weapons firms between October 2023 and July 2025. This includes over 421,000 bullets, with one shipment of 175,000 in April 2025. Additionally, three cartridge shipments from a Quebec-based General Dynamics facility were sent just nine days after Canada pledged to block munitions exports. These exports primarily supplied Elbit Systems, 'israel's largest arms manufacturer. Canada continues its systematic deception in a continued breach of domestic and international law, highlighting its role in sustaining the ongoing genocide against the Palestinian people."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-07-29T04:15:51+00:00",
        "text": "Gaza Defends Egypt, while al-Sisi Defends His Complicit Regime"
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-29T09:22:54+00:00",
        "text": "Israel's best-selling English-language newspaper is seeking a talented individual to join our passionate team! Could that be you or someone you know?"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:30:39+00:00",
        "text": "In Gaza, the eyes cry blood and pain lives in the features, and the bodies have become skeletal frames devoured by the fangs of hunger in deadly silence, and lost children search among the rubble for a bite to ease the pangs of life, and their small hearts carry pain beyond their years, while the world passes by with its heavy silence."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:03:37+00:00",
        "text": "The Zionist occupation aircraft are launching violent raids on Haidar Abdel Shafi roundabout, west of Gaza City, now."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:00:36+00:00",
        "text": "In which law are prisoner exchange deals conducted, only for the released prisoners to be re-arrested afterward? If there were justice, the world would stand against the crime of re-arresting Palestinian prisoners released through official agreements. The Zionist occupation acts as if it is above the law, and the mediators who took part in these deals bear responsibility through their disgraceful silence. These violations do not expire with time, and they prove that this entity understands nothing but the language of force."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T15:54:37+00:00",
        "text": "After their return from the front lines. Al-Qassam fighters confirmed targeting a \"Merkava\" tank tower with a Tandem shell east of Jabalia city in the northern Gaza Strip on 2025721"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T12:56:24+00:00",
        "text": "Al-Qassam Brigades target a Zionist troop carrier with a powerful landmine in the Abasan Al-Kabira area east of Khan Yunis city in the southern Gaza Strip"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T04:49:57+00:00",
        "text": "Macron: I will recognize the Palestinian state next September at the UN General Assembly meetings."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-26T18:53:18+00:00",
        "text": "Al-Qassam fighters, in cooperation with the Al-Quds Brigades fighters, managed to shell an enemy command and control site near the courts complex south of Khan Younis city in the southern Gaza Strip with several mortar shells"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-28T17:01:48+00:00",
        "text": "IDF: A short while ago, a terrorist hurled a brick toward IDF soldiers during an operational activity in Hebron. The soldiers fired toward the terrorist in order to remove the threat. The terrorist was neutralized, and no IDF injuries were reported."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-28T12:32:54+00:00",
        "text": "IDF: Today Monday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE and Jordan, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 20 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T16:26:36+00:00",
        "text": "IDF: Today Sunday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE and Jordan, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 28 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T12:14:10+00:00",
        "text": "IDF: Earlier today Sunday, an officer in the Desert Reconnaissance Battalion 585, and a reservist tracker in the Southern Brigade, Gaza Division, were severely injured during combat in the southern Gaza Strip. The officer and tracker were evacuated to a hospital to receive medical treatment, and their families have been notified."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T12:02:52+00:00",
        "text": "IDF: Troops of the 646th Reservist Brigade Dismantled a Terror Tunnel Route as Well as Hundreds of Terrorist Infrastructure Sites Both Above and Below Ground Troops from the 646th Brigade, under the command of the 99th Division, operated over the past three months in the areas of the Netzarim corridor, Shuja'iyya, Daraj Tuffah, and Beit Hanoun in the Gaza Strip. During the activities, the troops located and dismantled hundreds of terrorist infrastructure sites, including military structures, weapons storage facilities, and enemy firing and observation positions. In addition, approximately 400 terrorists were eliminated, as a result of cooperation between ground troops and the Israeli Air Force. In recent days, troops from the 646th Brigade and Yahalom unit dismantled a Hamas terror tunnel approximately 500 meters long in the Beit Hanoun area. The tunnel was located as part of an ongoing effort to locate and dismantle underground routes used by the Hamas terrorist organization. IDF troops continue to operate against terrorist organizations in the Gaza Strip in order to protect Israeli civilians. Attached are the following: Footage from within the Hamas terror tunnel in the Beit Hanoun area: Footage from the dismantling of the Hamas terror tunnel in the Beit Hanoun area: Photos of the activities of the 646th Brigade in the Gaza Strip:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T06:03:10+00:00",
        "text": "Attached is an IDF announcement regarding the names of two fallen soldiers whose families have been notified: Additionally, attached is a link to the IDF website, where updates on fallen soldiers are published:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-26T23:06:30+00:00",
        "text": "IDF: Footage From the Airdrop of Humanitarian Aid in the Gaza Strip In accordance with the directives of the political echelon, the IDF recently carried out an airdrop of humanitarian aid as part of the ongoing efforts to allow and facilitate the entry of aid into the Gaza Strip. The airdrop, which was carried out in coordination with international organizations and led by COGAT, included seven packages of aid containing flour, sugar, and canned food. Attached are the following: Footage from the airdrop of humanitarian aid as part of the efforts to deliver aid to the Gaza Strip: Footage from the preparations for the airdrop of the humanitarian aid: Additional footage: Related photos:"
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-28T09:46:33+00:00",
        "text": "The remains of an IDF reservist were discovered in his home in southern Israel, the military said. He had previously served in the Military Rabbinate, identifying fallen soldiers."
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-27T14:25:07+00:00",
        "text": "IDF troops from the 646th Reservist Brigade dismantled a Hamas tunnel about 500 meters long in Beit Hanoun, as part of a months-long operation."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T20:15:39+00:00",
        "text": "Dozens of martyrs and injuries in the meantime west of Gaza City"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T18:03:44+00:00",
        "text": "Al-Qassam Brigades: Scenes of the detonation of three landmines inside an enemy vehicle hangar in the Batn Al-Sameen area, southwest of Khan Yunis, and the destruction of enemy positions and gatherings in the city's incursion axes with rockets and mortar shells."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T17:41:32+00:00",
        "text": "Three deaths, including two children, due to famine and malnutrition in the past 24 hours."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T17:38:39+00:00",
        "text": "72 martyrs and about 400 wounded as a result of the Israeli bombing and targeting of aid recipients in the Gaza Strip and the northern Gaza Strip."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T10:48:26+00:00",
        "text": "Where are you from us, we are dying of hunger in Gaza"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T10:34:51+00:00",
        "text": "32 martyrs by Israeli occupation army fire in Gaza, including 11 aid seekers"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T10:22:44+00:00",
        "text": "Sisi: Call for a ceasefire and reconstruction of Gaza."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T09:56:00+00:00",
        "text": "On Friday, Muslims around the world head to mosques. But in Gaza, the mosques have been destroyed, the schools no longer teach, and homes have become ruins. Yet despite all of that, Faith remains alive, hearts stay connected to God, and prayers never cease. In Gaza, prayers rise from beneath the rubble, and hands are raised under open skies. Those who lost shelter never lost their steadfastness, and those who lost bread never lost their prayers. This is Gaza. where faith is stronger than the ruins, and patience is greater than the siege."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T08:52:54+00:00",
        "text": "In Gaza, hunger bites the bodies of children. They put their hands to their mouths. no food, no medicine, just pain that the world sees and remains silent."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-01T06:28:07+00:00",
        "text": "While you gather with your families on Friday around tables of food, we are being bled and sit hungry in Gaza. You raise your hands in gratitude, and we raise ours in plea. The scent of bread and meals fills your homes, while the scent of smoke and destruction fills ours. You have a Friday of warmth and peace, and we have a Friday of bombing, loss, and the silence of graves."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-01T16:36:53+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago in several areas in Israel, a missile that was launched from Yemen was intercepted by the IAF. Sirens were sounded in accordance with protocol."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-01T16:31:39+00:00",
        "text": "IDF: Initial report - Sirens sounded in several areas in Israel following a projectile that was launched from Yemen. The details are under review."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-01T15:06:16+00:00",
        "text": "IDF: First Airdrop in Cooperation with Spain, France, and Germany: 126 Aid Packages Were Airdropped to the Gaza Strip Today Friday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE, Jordan, Egypt, Spain, France, and Germany. The IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 126 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped by six different countries. Several countries joined the airdrop operations for the first time today, including France, Spain, and Germany. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-01T07:29:35+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago in the communities near the Gaza Strip, an interceptor was launched toward a target that was determined to be a false identification. Sirens were sounded in accordance with protocol."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-01T07:18:54+00:00",
        "text": "IDF: Initial report - Sirens sounded in the communities near the Gaza Strip. The details are under review."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-08-01T18:30:37+00:00",
        "text": "Triumphing for the oppressed Palestinian people and their dear Mujahideen, and in response to the crimes of genocide committed by the Zionist enemy against our people in the Gaza Strip. The missile force of the Yemeni Armed Forces carried out a qualitative military operation targeting Lod Airport in the occupied Yaffa region using a \"Palestine 2\" hypersonic ballistic missile. The operation successfully achieved its goal, thanks to Allah, and caused more than four million Zionist invaders to flee to shelters, bringing the airport to a standstill. The Yemeni Armed Forces are monitoring the enemy's movements and its plan aimed to halt the Yemeni support front, and they affirm that they, along with all the free of our proud, steadfast, and struggling people, with Allah's help and reliance on Allah, are highly vigilant and fully prepared to confront all hostile movements until they are thwarted, just as other plans, conspiracies, and movements have failed during the past period. Our great Yemeni people and their armed forces will remain steadfast in their support for the oppressed Palestinian people, and our operations will continue until the aggression stops and the siege on the Gaza Strip is lifted. Sana'a, Safar 7, 1447 AH, August 1, 2025 AD. Issued by the Yemeni Armed Forces"
    },
    {
        "channel": "PalestineResist",
        "date": "2025-08-01T13:27:36+00:00",
        "text": "Commander Ismail Haniyeh final statement a few days before his martyrdom called for August 3rd to be an international day of action and solidarity in support of Gaza and the prisoners. Let us heed the words of our martyred leader to make the voice of struggle and resistance heard around the world."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-08-01T05:33:20+00:00",
        "text": "Barakat: A popular flood is coming, and Saudi Arabia and France are leading a political extermination of our national rights"
    },
    {
        "channel": "PalestineResist",
        "date": "2025-08-01T02:46:10+00:00",
        "text": "A full judicial review of the British Home Secretary's decision to proscribe Palestine Action as a 'terror group' has been granted. The legal challenge will take place over 3 days in November to be yet determined. If successful, the proscription and ban of the group would be annulled. UN special human rights rapporteur Ben Saul was granted permission to intervene in the judicial review against the proscription. He wrote a letter to the British government earlier this year stating: \"Treating direct action, - albeit involving some violence - as 'terrorism' over-states the nature of the conduct and seriously risks chilling the exercise of freedom of expression\"."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-03T17:58:56+00:00",
        "text": "Breaking The military spokesperson for the Al-Qassam Brigades, Abu Ubaida: The Al-Qassam Brigades are ready to positively engage and respond to any request from the Red Cross to deliver food and medicine to the enemy captives. We stipulate for accepting this the natural and permanent opening of humanitarian corridors for the passage of food and medicine to all our people in all areas of the Gaza Strip, and the halting of all forms of enemy aerial activity during the times of delivering the packages to the captives. The Al-Qassam Brigades do not deliberately starve the captives, but they eat from what our fighters and the general public of our people eat from, and they will not obtain any special privilege amid the crime of starvation and the blockade."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-03T17:51:55+00:00",
        "text": "In a few moments. Abu Obeida, spokesman for the Izz ad-Din al-Qassam Brigades, the military wing of the Islamic Resistance Movement, Hamas."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-03T16:55:09+00:00",
        "text": "About 92 martyrs in the occupation's targeting of the Gaza Strip, including 56 aid recipients."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-03T14:01:30+00:00",
        "text": "IDF: Today Sunday, in accordance with the directives from the political echelon, and as part of the cooperation between Israel, the UAE, Jordan, Egypt, France, Germany, and Belgium, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 136 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped by six different countries. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-03T13:44:03+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago regarding a hostile aircraft infiltration in Bnei Netzarim, a suspicious aerial target launched from Yemen was intercepted by the IAF."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-03T08:10:25+00:00",
        "text": "IDF: In an Activity With Four Simultaneous Targets: IDF Troops Located and Confiscated Weapons in Southern Syria Overnight, troops of the 226th Brigade under the command of the 210th Division, in cooperation with field investigators from Unit 504, completed a mission involving on-site questioning of several suspects involved in weapons trafficking in the Hader area in southern Syria. Following prior intelligence surveillance and an in-depth field investigation, the troops entered four locations simultaneously and located numerous weapons that the suspects had been trafficking. Troops of the 210th Division remain deployed in the area, continuing to operate and prevent the entrenchment of any terrorist elements in Syria, with the aim of protecting Israeli civilians, and in particular, the residents of the Golan Heights. Attached is the full announcement and visuals:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-02T22:17:17+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago in the communities surrounding the Gaza Strip, a projectile that was launched from the southern Gaza Strip was most likely intercepted."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-02T22:03:38+00:00",
        "text": "IDF: Initial report - Sirens sounded in communities surrounding the Gaza Strip. The details are under review."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-08-03T17:11:01+00:00",
        "text": "Triumphing for the oppressed Palestinian people and their dear Mujahideen, and in response to the crimes of genocide and starvation perpetrated by the Zionist enemy against our people in the Gaza Strip. and in response to the storming of Al-Aqsa Mosque by Zionist hordes and their desecration of its holy courtyards. The UAV force of the Yemeni Armed Forces carried out three qualitative military operations targeted three Israeli enemy targets using three drones. Two of the operations targeted two Zionist enemy military targets in the areas of Yaffa and Ashkelon, while the third targeted the port of Haifa in occupied Palestine. Yemen, with its loyal people, faithful leadership, and mujahid army, and with trust and reliance on Allah, will not abandon its religious, moral, and humanitarian duties toward our Palestinian people, Al-Aqsa Mosque, and our brothers in Gaza, who are being subjected to killing and starvation by aggression and siege. Silence on the genocidal war against our people in Gaza is a disgrace and a shame that will continue to haunt this nation throughout its history, and its consequences will be dire for all peoples and all countries, sooner or later. Yemen will continue its support operations until the aggression stops and the siege on the Gaza Strip is lifted. Sana'a, Safar 9, 1447 AH August 3, 2025 AD Issued by the Yemeni Armed Forces"
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-08-03T08:39:06+00:00",
        "text": "IDF soldiers operated in four locations across southern Syria overnight, arresting multiple suspects involved in weapons smuggling. Numerous weapons were seized, based on prior intel and field investigations, the military said."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-02T16:40:03+00:00",
        "text": "8 martyrs in an Israeli bombardment targeting people waiting for aid in the Zikim area, north of Gaza."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-02T15:05:31+00:00",
        "text": "51 martir akibat tembakan pendudukan Israel di Jalur Gaza, termasuk 27 penerima bantuan."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-08-02T09:02:01+00:00",
        "text": "Gaza still screams in the face of silence, and no one answers. It groans under the weight of hunger and siege, exchanging pain instead of peace, resisting the darkness with a heart worn down by wounds. In every corner of its streets, a story is told with blood and tears. And despite all this, the world remains content with just watching."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-31T12:14:12+00:00",
        "text": "The Al-Qassam fighters, in cooperation with the Al-Quds Brigades fighters, managed to shell an enemy command and control site in the Moraj axis south of Khan Younis city in the southern Gaza Strip with a number of mortar shells"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-31T11:40:07+00:00",
        "text": "After their return from the front lines. Al-Qassam fighters confirmed the sniping of two Zionist soldiers and their direct injury near the Nazareth School on Baghdad Street in the Al-Shujaiya neighborhood east of Gaza City on 10-07-2025 AD"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-31T07:01:28+00:00",
        "text": "Canadian Prime Minister: We plan to recognize the Palestinian state in September."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-31T06:58:25+00:00",
        "text": "The Al-Qassam Brigades shell a gathering of enemy soldiers and vehicles with a number of mortar shells east of the Qarara area, east of Khan Yunis city, south of the Gaza Strip"
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-03T20:14:43+00:00",
        "text": "IDF: Earlier today Sunday, a soldier in the Desert Reconnaissance Battalion 585, Southern Brigade, Gaza Division, was severely injured in an operational accident in the communities near the Gaza Strip. The soldier was evacuated to a hospital to receive medical treatment and his family has been notified."
    },
    {
        "channel": "idfofficial",
        "date": "2025-08-02T14:45:32+00:00",
        "text": "IDF: Today Saturday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE, Jordan, Egypt, France, and Germany. The IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 90 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped by five different countries. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-31T16:20:05+00:00",
        "text": "IDF: Today Thursday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE, Jordan and Egypt, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 43 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-31T16:07:08+00:00",
        "text": "IDF: A short while ago, the IDF struck infrastructure that was used for producing and storing strategic weapons in the Beqaa area and in southern Lebanon. Among the targets struck were explosive manufacturing sites, which were used to develop Hezbollah's weaponry, as well as an underground site for the production and storage of strategic weapons. The Hezbollah terrorist organization tried to rehabilitate the sites and capabilities, actions that constitute a violation of the understandings between Israel and Lebanon. The IDF will continue to operate in order to protect Israeli civilians."
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-31T07:24:50+00:00",
        "text": "The 98th Division has completed its mission in northern Gaza after weeks of fighting in Khan Yunis, Shejaiya and Zeitoun. Troops dismantled 1,500 terror sites and killed dozens of Hamas operatives, including some involved in the October 7 massacre."
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-30T12:47:59+00:00",
        "text": "Hasbara activist Yoseph Haddad was detained after accidentally firing a bullet during an argument between drivers in Jaffa. Police say two people were detained; no injuries were reported."
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-30T12:06:30+00:00",
        "text": "A 15-year-old was shot in the back after a reservist fired at stone-throwers near the evacuated Tzur Harel outpost. He is conscious; military and police are investigating."
    }
]