[
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T19:36:43+00:00",
        "text": "In Gaza. words have run out. There is no description that can capture the scale of famine and genocide. We are dying in silence, and the world watches. Do not forget us."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T17:30:21+00:00",
        "text": "She died of hunger in the Muslim countries, Gaza now"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T14:44:22+00:00",
        "text": "A child has died of starvation in the central Gaza Strip."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T13:56:29+00:00",
        "text": "The oppression in people's eyes and the extent of the disappointment is indescribable"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T09:10:40+00:00",
        "text": "A starving Palestinian family weeps after the head of the family was able to obtain a bag of flour and return to them safely in Gaza."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-29T07:17:01+00:00",
        "text": "The children of Gaza. half-souls dying slowly, infants writhing with hunger, their thin bodies screaming soundlessly, no milk, no food, no medicine, not even a glimmer of hope, their little hearts dying silently, they have known nothing of life but oppression, and their bodies have turned into skeletons, as if life abandoned them before it even began."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:37:32+00:00",
        "text": "IDF: Following the sirens that sounded a short while ago in several areas in Israel, a missile launched from Yemen was intercepted by the IAF. Sirens were sounded in accordance with protocol."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:33:22+00:00",
        "text": "IDF: Initial report - Sirens sounded in several areas in Israel following a projectile that was launched from Yemen. The details are under review."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T17:13:39+00:00",
        "text": "IDF: A One-Kilometer-Long Tunnel Containing Hamas Explosive Devices and Weapons Was Located: Footage From the Activity of Golani Brigade Troops in the Gaza Strip Troops from the Golani Brigade, under the command of the 36th Division, are operating in the Khan Yunis area of the Gaza Strip. As part of the activity, troops from the Golani Brigade and the Yahalom Unit located an underground tunnel approximately one kilometer long and 15 meters deep, in which weaponry belonging to the Hamas terrorist organization was hidden, including explosives, AK-47 rifles, and RPG missiles. The tunnel was partially dismantled. In addition, the troops eliminated dozens of terrorists and dismantled numerous terrorist infrastructure sites, including military structures, weapons stockpiles, observation posts, and launch positions aimed at our troops. Troops from the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect the civilians of the State of Israel. Attached are the following: Footage from within an underground tunnel where weapons were located: Footage from the body cameras of the Golani Reconnaissance Battalion in the Gaza Strip: Footage from the dismantling of terror infrastructure sites in the Gaza Strip:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T13:36:06+00:00",
        "text": "IDF: Earlier today Tuesday, IDF troops operating in southern Khan Yunis conducted targeted raids on weapons storage locations. The weapons included cartridges, grenades, munitions, diving equipment and combat uniforms. IDF troops continue to operate in the Khan Yunis area in the southern Gaza Strip, to locate and dismantle terrorist infrastructure of the Hamas terrorist organization. Attached are photos of the weapons that were located:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T12:24:49+00:00",
        "text": "IDF: Today Tuesday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE, Jordan and Egypt, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 52 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-29T09:05:44+00:00",
        "text": "IDF: Directed by IDF and ISA intelligence, IDF troops continue operations against terrorist organizations in the Gaza Strip In the Khan Yunis area, IDF troops eliminated several terrorists who posed a threat, while the IAF targeted terrorist infrastructure and multiple weapons storage facilities over the past day. In one strike, secondary explosions were identified following the strike on a weapons storage facility, indicating the presence of large quantities of weapons in the structure. Throughout the past day, IDF troops continued operating in the areas in northern Gaza, dismantling launch and fire capabilities and dismantling terrorist infrastructure both above and below ground. Several terrorists were eliminated in ground engagements. Over the past day, the IAF, in cooperation with ground troops, struck dozens of terror targets across the Gaza Strip, including terrorists, military structures, launch posts, weapons storage facilities, tunnels, military posts, and other terrorist infrastructure."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-07-29T22:25:54+00:00",
        "text": "A new investigation published by Arms Embargo Now Campaign AEN reveals Canada has continued supplying weapons to 'israel' during its assault on Gaza, contradicting official claims that such exports had stopped. Newly uncovered shipping records and 'israeli' government data show 47 documented shipments of military components from Canadian manufacturers to 'israeli' weapons firms between October 2023 and July 2025. This includes over 421,000 bullets, with one shipment of 175,000 in April 2025. Additionally, three cartridge shipments from a Quebec-based General Dynamics facility were sent just nine days after Canada pledged to block munitions exports. These exports primarily supplied Elbit Systems, 'israel's largest arms manufacturer. Canada continues its systematic deception in a continued breach of domestic and international law, highlighting its role in sustaining the ongoing genocide against the Palestinian people."
    },
    {
        "channel": "PalestineResist",
        "date": "2025-07-29T04:15:51+00:00",
        "text": "Gaza Defends Egypt, while al-Sisi Defends His Complicit Regime"
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-29T09:22:54+00:00",
        "text": "Israel's best-selling English-language newspaper is seeking a talented individual to join our passionate team! Could that be you or someone you know?"
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:30:39+00:00",
        "text": "In Gaza, the eyes cry blood and pain lives in the features, and the bodies have become skeletal frames devoured by the fangs of hunger in deadly silence, and lost children search among the rubble for a bite to ease the pangs of life, and their small hearts carry pain beyond their years, while the world passes by with its heavy silence."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:03:37+00:00",
        "text": "The Zionist occupation aircraft are launching violent raids on Haidar Abdel Shafi roundabout, west of Gaza City, now."
    },
    {
        "channel": "gazaalanpa",
        "date": "2025-07-28T23:00:36+00:00",
        "text": "In which law are prisoner exchange deals conducted, only for the released prisoners to be re-arrested afterward? If there were justice, the world would stand against the crime of re-arresting Palestinian prisoners released through official agreements. The Zionist occupation acts as if it is above the law, and the mediators who took part in these deals bear responsibility through their disgraceful silence. These violations do not expire with time, and they prove that this entity understands nothing but the language of force."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T15:54:37+00:00",
        "text": "After their return from the front lines. Al-Qassam fighters confirmed targeting a \"Merkava\" tank tower with a Tandem shell east of Jabalia city in the northern Gaza Strip on 2025721"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T12:56:24+00:00",
        "text": "Al-Qassam Brigades target a Zionist troop carrier with a powerful landmine in the Abasan Al-Kabira area east of Khan Yunis city in the southern Gaza Strip"
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-27T04:49:57+00:00",
        "text": "Macron: I will recognize the Palestinian state next September at the UN General Assembly meetings."
    },
    {
        "channel": "abuobaidahenglish",
        "date": "2025-07-26T18:53:18+00:00",
        "text": "Al-Qassam fighters, in cooperation with the Al-Quds Brigades fighters, managed to shell an enemy command and control site near the courts complex south of Khan Younis city in the southern Gaza Strip with several mortar shells"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-28T17:01:48+00:00",
        "text": "IDF: A short while ago, a terrorist hurled a brick toward IDF soldiers during an operational activity in Hebron. The soldiers fired toward the terrorist in order to remove the threat. The terrorist was neutralized, and no IDF injuries were reported."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-28T12:32:54+00:00",
        "text": "IDF: Today Monday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE and Jordan, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 20 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T16:26:36+00:00",
        "text": "IDF: Today Sunday, in accordance with the directives from the political echelon and as part of the cooperation between Israel, the UAE and Jordan, the IDF, led by COGAT, is continuing the series of actions aimed at improving the humanitarian response in the Gaza Strip. Over the past few hours, 28 aid packages, containing food for the residents of both the southern and northern Gaza Strip, were airdropped. The IDF will continue to work in order to improve the humanitarian response in the Gaza Strip, along with the international community, while refuting the false claims of deliberate starvation in Gaza."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T12:14:10+00:00",
        "text": "IDF: Earlier today Sunday, an officer in the Desert Reconnaissance Battalion 585, and a reservist tracker in the Southern Brigade, Gaza Division, were severely injured during combat in the southern Gaza Strip. The officer and tracker were evacuated to a hospital to receive medical treatment, and their families have been notified."
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T12:02:52+00:00",
        "text": "IDF: Troops of the 646th Reservist Brigade Dismantled a Terror Tunnel Route as Well as Hundreds of Terrorist Infrastructure Sites Both Above and Below Ground Troops from the 646th Brigade, under the command of the 99th Division, operated over the past three months in the areas of the Netzarim corridor, Shuja'iyya, Daraj Tuffah, and Beit Hanoun in the Gaza Strip. During the activities, the troops located and dismantled hundreds of terrorist infrastructure sites, including military structures, weapons storage facilities, and enemy firing and observation positions. In addition, approximately 400 terrorists were eliminated, as a result of cooperation between ground troops and the Israeli Air Force. In recent days, troops from the 646th Brigade and Yahalom unit dismantled a Hamas terror tunnel approximately 500 meters long in the Beit Hanoun area. The tunnel was located as part of an ongoing effort to locate and dismantle underground routes used by the Hamas terrorist organization. IDF troops continue to operate against terrorist organizations in the Gaza Strip in order to protect Israeli civilians. Attached are the following: Footage from within the Hamas terror tunnel in the Beit Hanoun area: Footage from the dismantling of the Hamas terror tunnel in the Beit Hanoun area: Photos of the activities of the 646th Brigade in the Gaza Strip:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-27T06:03:10+00:00",
        "text": "Attached is an IDF announcement regarding the names of two fallen soldiers whose families have been notified: Additionally, attached is a link to the IDF website, where updates on fallen soldiers are published:"
    },
    {
        "channel": "idfofficial",
        "date": "2025-07-26T23:06:30+00:00",
        "text": "IDF: Footage From the Airdrop of Humanitarian Aid in the Gaza Strip In accordance with the directives of the political echelon, the IDF recently carried out an airdrop of humanitarian aid as part of the ongoing efforts to allow and facilitate the entry of aid into the Gaza Strip. The airdrop, which was carried out in coordination with international organizations and led by COGAT, included seven packages of aid containing flour, sugar, and canned food. Attached are the following: Footage from the airdrop of humanitarian aid as part of the efforts to deliver aid to the Gaza Strip: Footage from the preparations for the airdrop of the humanitarian aid: Additional footage: Related photos:"
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-28T09:46:33+00:00",
        "text": "The remains of an IDF reservist were discovered in his home in southern Israel, the military said. He had previously served in the Military Rabbinate, identifying fallen soldiers."
    },
    {
        "channel": "the_jerusalem_post",
        "date": "2025-07-27T14:25:07+00:00",
        "text": "IDF troops from the 646th Reservist Brigade dismantled a Hamas tunnel about 500 meters long in Beit Hanoun, as part of a months-long operation."
    }
]