[
    {
        "text": "Wounded by the occupation forces' shelling of the vicinity of Al-Asdekaa Cafeteria in Mawasi, Khan Yunis, south of the Gaza Strip.",
        "cleaned_text": "Israeli forces shelled the vicinity of Al-Asdekaa Cafeteria in Mawasi, Khan Yunis, southern Gaza Strip.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T20:00:10+00:00",
        "locations": [
            "Al-Asdekaa Cafeteria Mawasi Khan Yunis Southern Gaza Strip"
        ]
    },
    {
        "text": "The occupation launched reconnaissance aircraft over Deir al-Balah in the central Gaza Strip, and called on the displaced to \"leave their tents and take to the streets immediately.\"",
        "cleaned_text": "Israeli occupation forces flew reconnaissance aircraft over Deir al-Balah in central Gaza Strip and ordered displaced civilians to leave their tents and take to the streets immediately.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:59:58+00:00",
        "locations": [
            "Deir Al-Balah Central Gaza Strip"
        ]
    },
    {
        "text": "Violent Zionist bombing of the Gaza Strip now",
        "cleaned_text": "IDF bombed Gaza Strip.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:57:40+00:00",
        "locations": [
            "Gaza Strip"
        ]
    },
    {
        "text": "The wife of Qassam Brigades commander Hussein Fayyad and their two children were killed as a result of the Israeli bombing of the Gaza Strip.",
        "cleaned_text": "Israeli bombing in Gaza killed wife and two children of Qassam Brigades commander Hussein Fayyad.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:56:50+00:00",
        "locations": [
            "Gaza"
        ]
    },
    {
        "text": "A child just had her leg amputated after being injured in the Israeli bombing in Gaza",
        "cleaned_text": "Israeli bombing in Gaza injured a child, resulting in amputation.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:53:11+00:00",
        "locations": [
            "Gaza"
        ]
    },
    {
        "text": "Breaking: An Israeli occupation bulldozer is currently running over the bodies of martyrs at the Zikim checkpoint, north of the Gaza Strip. It is digging a large pit and throwing the bodies inside. Dozens of unidentified martyrs have now been buried without any information about their identities.",
        "cleaned_text": "Israeli bulldozer ran over bodies at Zikim checkpoint north of Gaza Strip, digging pit and burying dozens of unidentified bodies.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:43:30+00:00",
        "locations": [
            "Zikim Checkpoint Gaza Strip"
        ]
    },
    {
        "text": "Saraya al-Quds: After returning from the battle lines, our fighters confirmed that they, in cooperation with the fighters of the Qassam Brigades, were able to target three Zionist Merkava tanks in a well-planned ambush carried out with Thaqib and Shawaaz explosive devices and a tandem missile in the vicinity of al-Radwan Mosque in the Shuja'iyya neighborhood east of Gaza City on 07-07-2025.",
        "cleaned_text": "Saraya al-Quds and Qassam Brigades targeted three Israeli Merkava tanks near al-Radwan Mosque in Shuja'iyya neighborhood east of Gaza City on July 7, 2025, using Thaqib and Shawaaz explosive devices and a tandem missile.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-20T13:58:47+00:00",
        "locations": [
            "Shuja'Iyya Neighborhood Gaza City"
        ]
    },
    {
        "text": "After their return from the front lines. Al-Qassam fighters, in cooperation with Al-Quds Brigades fighters, confirmed targeting 3 Zionist tanks of the \"Merkava\" type with \"Shawaz\" and \"Thaqib\" bombs and a \"Tandum\" shell around Al-Ridwan Mosque in the Al-Shujaiya neighborhood east of Gaza City on 07-07-2025 AD",
        "cleaned_text": "Al-Qassam and Al-Quds Brigades fighters targeted 3 Israeli Merkava tanks with Shawaz, Thaqib bombs, and a Tandum shell near Al-Ridwan Mosque in Al-Shujaiya neighborhood, east of Gaza City on July 7, 2025.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-20T10:35:23+00:00",
        "locations": [
            "Al-Ridwan Mosque Al-Shujaiya Neighborhood Gaza City"
        ]
    },
    {
        "text": "IDF: Operations of the Paratroopers Brigade in Khan Yunis Today Sunday, troops of the Paratroopers Brigade, under the command of the 36th Division, completed their mission in the Khan Yunis area of the Gaza Strip. During the operations, the troops eliminated terrorists in close-quarters combat and in cooperation with the Israeli Air Force. They dismantled terror infrastructure, including military structures, weapons storage facilities, arms, and explosives. Additionally, in cooperation with combat engineers from the Yahalom Unit, they dismantled several underground routes used by terrorist organizations in the Gaza Strip. In one of the operations, the troops identified Hamas terrorists and quickly eliminated them before they could approach the troops. The Paratroopers Brigade will continue on its next mission in the Judea and Samaria area. Troops of the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect the security of the citizens of the State of Israel, and specifically the residents of the communities near the Gaza Strip. Attached are the full announcement and visuals:",
        "cleaned_text": "IDF Paratroopers Brigade completed operations in Khan Yunis, Gaza Strip today. Troops eliminated terrorists in close-quarters combat with support from Israeli Air Force. They dismantled terror infrastructure, including military structures, weapons storage, arms, and explosives.",
        "channel": "idfofficial",
        "date": "2025-07-20T16:18:34+00:00",
        "locations": [
            "Khan Yunis Gaza Strip"
        ]
    },
    {
        "text": "IDF: Strikes on Military Targets and Air Support for Ground Troops: The Israeli Air Force Operates in the Gaza Strip The troops are expanding ground activities in the Jabaliya area and are operating against terrorist organizations in the area. So far, hundreds of terrorist infrastructure sites have been dismantled, numerous weapons have been located, and dozens of terrorists have been eliminated. Combat Engineering troops of the 401st Brigade located and dismantled underground terror tunnels in the Jabaliya area, measuring 2.7 kilometers in length and approximately 20 meters in depth. Troops of the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect Israeli civilians, and particularly the residents of the communities near the Gaza Strip. Attached are the full announcement and visuals:",
        "cleaned_text": "IDF conducted airstrikes on military targets in the Gaza Strip and provided air support for ground troops expanding operations in the Jabaliya area. IDF troops dismantled hundreds of terrorist infrastructure sites, located numerous weapons, and eliminated dozens of terrorists. Combat Engineering troops of the 401st Brigade located and dismantled underground terror tunnels.",
        "channel": "idfofficial",
        "date": "2025-07-20T07:03:06+00:00",
        "locations": [
            "Gaza Strip",
            "Jabaliya"
        ]
    },
    {
        "text": "IDF issued evacuation warnings for residents in Deir al-Balah in area it has not operated in before.",
        "cleaned_text": "IDF issued evacuation warnings for residents in Deir al-Balah.",
        "channel": "the_jerusalem_post",
        "date": "2025-07-20T06:32:28+00:00",
        "locations": [
            "Deir Al-Balah"
        ]
    },
    {
        "text": "6 martyrs and a number of wounded as a result of the occupation's bombing of displaced people in the fishermen's port, west of Gaza City.",
        "cleaned_text": "Six people were killed and several others wounded in an Israeli bombing of displaced people at the fishermen's port west of Gaza City.",
        "channel": "gazaalanpa",
        "date": "2025-07-21T14:54:42+00:00",
        "locations": [
            "Fishermen'S Port Gaza City"
        ]
    },
    {
        "text": "IDF: Initial report - sirens sounded in the area of Nir Am, the details are under review.",
        "cleaned_text": "IDF reported sirens sounded in Nir Am.",
        "channel": "idfofficial",
        "date": "2025-07-21T15:38:44+00:00",
        "locations": [
            "Nir Am"
        ]
    },
    {
        "text": "IDF: The IDF Struck Military Targets Belonging to the Houthi Terrorist Regime at the Hudaydah Port The IDF struck and dismantled military infrastructure belonging to the Houthi terrorist regime at the Hudaydah port. Among the military infrastructure struck were engineering vehicles used to reestablish the port's infrastructure, fuel containers, naval vessels used for military activities and force against the State of Israel and vessels in the maritime zone adjacent to the port, and additional terror infrastructure used by the Houthi terrorist regime. The port has been used, among other things, to transfer weapons from the Iranian regime, which are then used by the Houthi terrorist regime to execute terrorist attacks against the State of Israel and its allies. The IDF has identified the continuous efforts and actions of the Houthi terrorist regime to reestablish terrorist infrastructure at the port, and as such, the components used to advance these efforts were struck. The Houthi terrorist regime exploits the maritime zone for the use of force and to carry out terrorist attacks against passing vessels and global maritime trade. The targets struck demonstrate how the Houthi terrorist regime utilizes civilian infrastructure for military and terrorist purposes. The IDF will operate decisively against the repeated attacks of the Houthi terrorist regime against Israeli civilians, and remains determined to continue operating against any threat posed to the civilians of the State of Israel, wherever it is required.",
        "cleaned_text": "IDF struck Houthi military infrastructure at Hudaydah port, including engineering vehicles, fuel containers, naval vessels, and other vessels in the adjacent maritime zone.",
        "channel": "idfofficial",
        "date": "2025-07-21T08:16:45+00:00",
        "locations": [
            "Hudaydah Port"
        ]
    },
    {
        "text": "BREAKING Israeli forces murdered journalist Tamer al-Zaanin and injured photojournalist Ibrahim Abu Ashiba while they were covering the abduction of Dr. Marwan al-Hams, Director of Abu Youssef al-Najjar Hospital near the Red Cross Hospital in Rafah.",
        "cleaned_text": "Israeli forces killed journalist Tamer al-Zaanin and injured photojournalist Ibrahim Abu Ashiba while covering an abduction near Abu Youssef al-Najjar Hospital in Rafah.",
        "channel": "PalestineResist",
        "date": "2025-07-21T12:14:49+00:00",
        "locations": [
            "Abu Youssef Al-Najjar Hospital Rafah"
        ]
    },
    {
        "text": "BREAKING According to family sources, an Israeli special forces unit has detained Dr. Marwan al-Hams, Director of Abu Youssef al-Najjar Hospital in Rafah, and wounded the driver of their ambulance in front of the Red Cross field hospital in the southern Gaza Strip.",
        "cleaned_text": "Israeli special forces detained Dr. Marwan al-Hams, Director of Abu Youssef al-Najjar Hospital, and wounded the driver of their ambulance in front of the Red Cross field hospital in southern Gaza.",
        "channel": "PalestineResist",
        "date": "2025-07-21T12:14:49+00:00",
        "locations": [
            "Red Cross Field Hospital Southern Gaza"
        ]
    },
    {
        "text": "The IDF and Shin Bet struck the hideout of top terrorist commander Hussein Fiad, known as Abu Hamza, in Beit Hanun. They are now waiting for confirmation that he was killed in the targeted operation.",
        "cleaned_text": "IDF and Shin Bet struck hideout of top commander Hussein Fiad in Beit Hanun.",
        "channel": "the_jerusalem_post",
        "date": "2025-07-21T07:05:27+00:00",
        "locations": [
            "Beit Hanun"
        ]
    }
]