[
    {
        "text": "Wounded by the occupation forces' shelling of the vicinity of Al-Asdekaa Cafeteria in Mawasi, Khan Yunis, south of the Gaza Strip.",
        "cleaned_text": "Israeli forces shelled the vicinity of Al-Asdekaa Cafeteria in Mawasi, Khan Yunis, southern Gaza Strip.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T20:00:10+00:00",
        "locations": [
            "Al-Asdekaa Cafeteria In Mawasi, Khan Yunis, Southern Gaza Strip"
        ]
    },
    {
        "text": "The occupation launched reconnaissance aircraft over Deir al-Balah in the central Gaza Strip, and called on the displaced to \"leave their tents and take to the streets immediately.\"",
        "cleaned_text": "The Israeli occupation launched reconnaissance aircraft over Deir al-Balah in central Gaza Strip and called on displaced people to leave their tents and take to the streets immediately.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:59:58+00:00",
        "locations": [
            "Deir Al-Balah In Central Gaza Strip"
        ]
    },
    {
        "text": "Violent Zionist bombing of the Gaza Strip now",
        "cleaned_text": "Israeli forces bombed the Gaza Strip.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:57:40+00:00",
        "locations": [
            "Gaza Strip"
        ]
    },
    {
        "text": "The wife of Qassam Brigades commander Hussein Fayyad and their two children were killed as a result of the Israeli bombing of the Gaza Strip.",
        "cleaned_text": "Israeli bombing in Gaza killed wife and two children of Qassam Brigades commander Hussein Fayyad.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:56:50+00:00",
        "locations": [
            "Gaza"
        ]
    },
    {
        "text": "A child just had her leg amputated after being injured in the Israeli bombing in Gaza",
        "cleaned_text": "A child had her leg amputated after being injured in Israeli bombing in Gaza.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:53:11+00:00",
        "locations": [
            "Gaza"
        ]
    },
    {
        "text": "Breaking: An Israeli occupation bulldozer is currently running over the bodies of martyrs at the Zikim checkpoint, north of the Gaza Strip. It is digging a large pit and throwing the bodies inside. Dozens of unidentified martyrs have now been buried without any information about their identities.",
        "cleaned_text": "Israeli bulldozer moved bodies at Zikim checkpoint north of Gaza Strip, burying dozens of unidentified individuals in a large pit.",
        "channel": "gazaalanpa",
        "date": "2025-07-20T19:43:30+00:00",
        "locations": [
            "Zikim Checkpoint North Of Gaza Strip"
        ]
    },
    {
        "text": "Saraya al-Quds: After returning from the battle lines, our fighters confirmed that they, in cooperation with the fighters of the Qassam Brigades, were able to target three Zionist Merkava tanks in a well-planned ambush carried out with Thaqib and Shawaaz explosive devices and a tandem missile in the vicinity of al-Radwan Mosque in the Shuja'iyya neighborhood east of Gaza City on 07-07-2025.",
        "cleaned_text": "Saraya al-Quds and Qassam Brigades targeted three Israeli Merkava tanks near al-Radwan Mosque in Shuja'iyya neighborhood, east of Gaza City, using Thaqib and Shawaaz explosive devices and a tandem missile on July 7, 2025.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-20T13:58:47+00:00",
        "locations": [
            "Shawaaz",
            "Al-Radwan Mosque In Shuja'Iyya Neighborhood, East Of Gaza City, Using Thaqib"
        ]
    },
    {
        "text": "After their return from the front lines. Al-Qassam fighters, in cooperation with Al-Quds Brigades fighters, confirmed targeting 3 Zionist tanks of the \"Merkava\" type with \"Shawaz\" and \"Thaqib\" bombs and a \"Tandum\" shell around Al-Ridwan Mosque in the Al-Shujaiya neighborhood east of Gaza City on 07-07-2025 AD",
        "cleaned_text": "Al-Qassam and Al-Quds Brigades fighters targeted 3 Israeli Merkava tanks with Shawaz, Thaqib bombs, and Tandum shells near Al-Ridwan Mosque in Al-Shujaiya neighborhood, east of Gaza City on 07-07-2025.",
        "channel": "abuobaidahenglish",
        "date": "2025-07-20T10:35:23+00:00",
        "locations": [
            "Al-Ridwan Mosque In Al-Shujaiya Neighborhood, East Of Gaza City"
        ]
    },
    {
        "text": "IDF: Operations of the Paratroopers Brigade in Khan Yunis Today Sunday, troops of the Paratroopers Brigade, under the command of the 36th Division, completed their mission in the Khan Yunis area of the Gaza Strip. During the operations, the troops eliminated terrorists in close-quarters combat and in cooperation with the Israeli Air Force. They dismantled terror infrastructure, including military structures, weapons storage facilities, arms, and explosives. Additionally, in cooperation with combat engineers from the Yahalom Unit, they dismantled several underground routes used by terrorist organizations in the Gaza Strip. In one of the operations, the troops identified Hamas terrorists and quickly eliminated them before they could approach the troops. The Paratroopers Brigade will continue on its next mission in the Judea and Samaria area. Troops of the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect the security of the citizens of the State of Israel, and specifically the residents of the communities near the Gaza Strip. Attached are the full announcement and visuals:",
        "cleaned_text": "IDF Paratroopers Brigade eliminated terrorists in Khan Yunis, Gaza Strip today. They dismantled terror infrastructure, including military structures and weapons storage facilities, in cooperation with the Israeli Air Force.",
        "channel": "idfofficial",
        "date": "2025-07-20T16:18:34+00:00",
        "locations": [
            "Khan Yunis, Gaza Strip"
        ]
    },
    {
        "text": "IDF: Strikes on Military Targets and Air Support for Ground Troops: The Israeli Air Force Operates in the Gaza Strip The troops are expanding ground activities in the Jabaliya area and are operating against terrorist organizations in the area. So far, hundreds of terrorist infrastructure sites have been dismantled, numerous weapons have been located, and dozens of terrorists have been eliminated. Combat Engineering troops of the 401st Brigade located and dismantled underground terror tunnels in the Jabaliya area, measuring 2.7 kilometers in length and approximately 20 meters in depth. Troops of the Southern Command continue to operate against terrorist organizations in the Gaza Strip in order to protect Israeli civilians, and particularly the residents of the communities near the Gaza Strip. Attached are the full announcement and visuals:",
        "cleaned_text": "IDF struck military targets in Gaza Strip. IDF troops expanded ground activities in Jabaliya area, operating against terrorist organizations. IDF dismantled hundreds of terrorist infrastructure sites, located numerous weapons, and eliminated dozens of terrorists. Combat Engineering troops of the 401st Brigade located and dismantled underground terror tunnels.",
        "channel": "idfofficial",
        "date": "2025-07-20T07:03:06+00:00",
        "locations": [
            "Gaza Strip. Idf Troops Expanded Ground Activities In Jabaliya"
        ]
    },
    {
        "text": "IDF issued evacuation warnings for residents in Deir al-Balah in area it has not operated in before.",
        "cleaned_text": "IDF issued evacuation warnings for residents in Deir al-Balah.",
        "channel": "the_jerusalem_post",
        "date": "2025-07-20T06:32:28+00:00",
        "locations": [
            "Deir Al-Balah"
        ]
    }
]